src/cf/InformationRegisters/АктивныеЗаданияОбновленияКэширующихДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>АктивныеЗаданияОбновленияКэширующихДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Долгое</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификаторЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/АктивныеЗаданияОбновленияКэширующихДанных/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает всю информацию об активных заданиях обновления.
// 
// Параметры:
//  Долгое - Булево
// 
// Возвращаемое значение:
//  Массив из УникальныйИдентификатор
// 
Функция АктивныеЗаданияОбновления(Долгое) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	АктивныеЗаданияОбновленияКэширующихДанных.УникальныйИдентификаторЗадания
		|ИЗ
		|	РегистрСведений.АктивныеЗаданияОбновленияКэширующихДанных КАК АктивныеЗаданияОбновленияКэширующихДанных
		|ГДЕ
		|	АктивныеЗаданияОбновленияКэширующихДанных.Долгое = &Долгое");
	
	Запрос.УстановитьПараметр("Долгое", Долгое);
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаРезультата = РезультатЗапроса.Выгрузить();
	
	АктивныеЗаданияОбновления = ТаблицаРезультата.ВыгрузитьКолонку("УникальныйИдентификаторЗадания");
	
	Возврат АктивныеЗаданияОбновления;
	
КонецФункции

// Добавляет информацию об активном задании обновления кэширующих данных.
// 
// Параметры:
//  УникальныйИдентификаторЗадания - УникальныйИдентификатор
//  Долгое - Булево
// 
Процедура Добавить(УникальныйИдентификаторЗадания, Долгое) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.УникальныйИдентификаторЗадания.Установить(УникальныйИдентификаторЗадания);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.УникальныйИдентификаторЗадания = УникальныйИдентификаторЗадания;
	НоваяЗапись.Долгое = Долгое;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Удаляет информацию об активном задании обновления кэширующих данных.
// 
// Параметры:
//  УникальныйИдентификаторЗадания - УникальныйИдентификатор.
// 
Процедура Удалить(УникальныйИдентификаторЗадания) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.УникальныйИдентификаторЗадания.Установить(УникальныйИдентификаторЗадания);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
